---
kind: other
id: Properties.T:Autodesk.Revit.DB.FailureMessage
source: html/8ddfac78-9e06-0e4f-6cb2-5de8c1e556fb.htm
---
# FailureMessage Properties

Specifies whether the .NET object represents a valid Revit entity.